static-benchmark-results/sglang_isl1000_osl1000_tp1_static/concurrency=128/bench.log
/localhome/local-triv/benchmark/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/benchmark/datasets/fixed_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=384, sharegpt_output_len=1000, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=128, output_file='/localhome/local-triv/benchmark/static-benchmark-results/sglang_isl1000_osl1000_tp1_static/concurrency=128/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/benchmark/datasets/fixed_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=384, sharegpt_output_len=1000, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=128, output_file='/localhome/local-triv/benchmark/static-benchmark-results/sglang_isl1000_osl1000_tp1_static/concurrency=128/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 384384
#Output tokens: 384000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 384/384 [06:30<00:00,  1.02s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     384       
Benchmark duration (s):                  390.58    
Total input tokens:                      384384    
Total generated tokens:                  384000    
Total generated tokens (retokenized):    383959    
Request throughput (req/s):              0.98      
Input token throughput (tok/s):          984.14    
Output token throughput (tok/s):         983.15    
Total token throughput (tok/s):          1967.29   
Concurrency:                             127.94    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   130131.18 
Median E2E Latency (ms):                 132743.39 
---------------Time to First Token----------------
Mean TTFT (ms):                          15016.82  
Median TTFT (ms):                        14350.90  
P99 TTFT (ms):                           31427.90  
---------------Inter-Token Latency----------------
Mean ITL (ms):                           115.23    
Median ITL (ms):                         99.77     
P95 ITL (ms):                            118.98    
P99 ITL (ms):                            155.06    
Max ITL (ms):                            31143.30  
==================================================